# XDC constraints for the Xilinx VCU108 board
# part: xcvu095-ffva2104-2-e

## General configuration
set_property CFGBVS GND                                [current_design]
set_property CONFIG_VOLTAGE 1.8                        [current_design]
set_property BITSTREAM.GENERAL.COMPRESS true           [current_design]
set_property BITSTREAM.CONFIG.EXTMASTERCCLK_EN {DIV-1} [current_design]
set_property BITSTREAM.CONFIG.BPI_SYNC_MODE Type1      [current_design]
set_property CONFIG_MODE BPI16                         [current_design]
set_property BITSTREAM.CONFIG.OVERTEMPSHUTDOWN Enable  [current_design]

## Reset button
set_property -dict {LOC E36 IOSTANDARD LVCMOS12} [get_ports rst]

## System clock generated by Silicon Labs SI5335A at 125 MHz
set_property -dict {LOC BC9 IOSTANDARD LVDS} [get_ports clk_125mhz_p]
set_property -dict {LOC BC8 IOSTANDARD LVDS} [get_ports clk_125mhz_n]
create_clock -period 8.000 -name clk_125mhz [get_ports clk_125mhz_p]

## UART
set_property -dict {LOC BE24 IOSTANDARD LVCMOS18 SLEW SLOW DRIVE 8} [get_ports uart_txd]
set_property -dict {LOC BC24 IOSTANDARD LVCMOS18} [get_ports uart_rxd]
# set_property -dict {LOC BF24 IOSTANDARD LVCMOS18 SLEW SLOW DRIVE 8} [get_ports uart_rts]
# set_property -dict {LOC BD22 IOSTANDARD LVCMOS18} [get_ports uart_cts]
# set_false_path -to [get_ports {uart_txd uart_rts}]
# set_output_delay 0 [get_ports {uart_txd uart_rts}]
# set_false_path -from [get_ports {uart_rxd uart_cts}]
# set_input_delay 0 [get_ports {uart_rxd uart_cts}]

# Mostly taken from: https://github.com/alexforencich/verilog-ethernet/blob/master/example/VCU108/fpga_1g/fpga.xdc#L101-L110
# Other references
# https://www.farnell.com/datasheets/2371569.pdf
# https://www.xilinx.com/content/dam/xilinx/support/packagefiles/usapackages/xcvu095ffva2104pkg.txt 
